# St7DisableWindowViewChanges

Disallows model window view changes by the application user (for example, clicking and dragging to rotate the
model).  Note that when the view toolbar is showing, the model window view can be changed by the user
irrespective of this setting.

Strand7 API Manual

long St7DisableWindowViewChanges(long uID)

Input Parameters

uID

Strand7 model file ID.